src/InformationRegisters/кфкПараметрыЛогирования/кфкПараметрыЛогирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПараметрыЛогирования</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьЗаголовкиСообщенияВходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьЗаголовкиСообщенияИсходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьИсходныеДанныеИсходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьТелоСообщенияВходящие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьТелоСообщенияИсходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/кфкПараметрыЛогирования/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = Метаданные.Обработки.кфкПанельАдминистрирования.ОсновнаяФорма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Использовать", Ложь);
	
	Результат.Вставить("АдресСервиса", "");
	Результат.Вставить("Префикс", "");
	
	// ИсходящиеСообщения
	Результат.Вставить("ВыгружатьИсходныеДанныеИсходящих", Ложь);
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияИсходящих", Ложь);
	
	// ВходящиеСообщения
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияВходящие", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПараметрыЛогирования.Использовать КАК Использовать,
	|	кфкПараметрыЛогирования.АдресСервиса КАК АдресСервиса,
	|	кфкПараметрыЛогирования.Префикс КАК Префикс,
	|	кфкПараметрыЛогирования.ВыгружатьЗаголовкиСообщенияВходящих КАК ВыгружатьЗаголовкиСообщенияВходящих,
	|	кфкПараметрыЛогирования.ВыгружатьЗаголовкиСообщенияИсходящих КАК ВыгружатьЗаголовкиСообщенияИсходящих,
	|	кфкПараметрыЛогирования.ВыгружатьИсходныеДанныеИсходящих КАК ВыгружатьИсходныеДанныеИсходящих,
	|	кфкПараметрыЛогирования.ВыгружатьТелоСообщенияВходящие КАК ВыгружатьТелоСообщенияВходящие,
	|	кфкПараметрыЛогирования.ВыгружатьТелоСообщенияИсходящих КАК ВыгружатьТелоСообщенияИсходящих
	|ИЗ
	|	РегистрСведений.кфкПараметрыЛогирования КАК кфкПараметрыЛогирования";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	Иначе
		ОбновитьПараметры(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПараметры(НовыеПараметры) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), НовыеПараметры);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
